Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ལག་པ་གཡས་པ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བདུན་ཅུ་རྩ་གཉིས་ཐམས་ཅད་ལས་འདས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཞིང་སྙུང་བ་ཆུང་ངམ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་བཞིན་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་སྣང་བ་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་ཕྱིན་པར་གྱུར་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེའི་ཞབས་ལ་ཕྱག་འཚལ་ནས།
en: Mañjuśrī Kumārabhūta’s right hand then passed by buddha realms as numerous as seventy-two times the number of grains of sand in the Ganges, prostrating at the feet of every blessed buddha present there and inquiring into their health. It finally reached the world called Luminous of the blessed thus-gone Raśmirāja.

source: བཅོམ་ལྡན་འདས་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་སྙུང་བ་མ་མཆིས་སམ། འོ་མ་བརྒྱལ་ཏམ། བཞེངས་པ་ཡང་ངམ། སོ་བཞིན་ནམ། མཐུ་མངའ་འམ། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་གསུང་ངོ་ཞེས་སྒྲ་ཕྱུང་ངོ་།
en: The hand prostrated at the feet of the blessed thus-gone Raśmirāja and asked, “The blessed, thus-gone, worthy, perfect Buddha Śākyamuni is inquiring whether you are free from illness, whether you are tired, whether you are healthy, whether you are comfortable, whether you are strong, and whether you are well.”

source: །ལག་པ་དེ་ལས་ཀྱང་འོད་ཟེར་བརྒྱ་སྟོང་བྱུང་ངོ་། །མེ་ཏོག་པད་མ་བརྒྱ་སྟོང་ཡང་བྱུང་བར་གྱུར་ཏེ།
en: From the hand sprang thousands of rays of light and thousands of lotus flowers.

source: འོད་ཟེར་དེ་དག་དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་དེ་དག་དང་ཡང་མ་འདྲེས་པར་གྱུར་ཏོ།
en: These rays of light, however, remained distinct from the Thus-Gone One’s own light rays.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེ་ལ་བསྙེན་བཀུར་བྱེད་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཀྱི་དཔལ་ཞེས་བྱ་བ་དེས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ལག་པ་དེ་ལས་འོད་ཟེར་བྱེ་བ་བརྒྱ་སྟོང་འདི་དག་ཀྱང་བྱུང་ཞིང་མེ་ཏོག་པད་མ་བརྒྱ་སྟོང་ཡང་བྱུང་བར་གྱུར་ལ།
en: Then a bodhisattva great being named Prabhāśrī who served the thus-gone Raśmirāja asked him, “Blessed One, billions of light rays and hundreds of thousands of lotus flowers spring from this hand.

source: པད་མ་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་དག་བཞུགས་ཤིང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་བསྔགས་པ་རྗོད་པར་གྱུར་པའི་ལག་པ་འདི་ལྟར་བལྟ་ན་སྡུག་པ།
en: On each of the lotus flowers are forms of thus-gone ones singing the praises of the blessed Śākyamuni.

source: འདི་ལྟར་དགའ་བར་བགྱིད་པ་དེ་སུའི་ལགས།
en: To whom does that hand, which is so beautiful and delightful to behold, belong?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འོད་ཀྱི་དཔལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འོད་ཀྱི་དཔལ་སྟེང་གི་ཕྱོགས་ཀྱི་ཆ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བདུན་ཅུ་རྩ་གཉིས་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་སོ་འཚོ་གཞེས་སོ།
en: The Blessed One answered the bodhisattva Prabhāśrī, “Prabhāśrī, above here, past buddha realms as numerous as seventy-two times the number of grains of sand in the Ganges, there is a world called Sahā, where the thus-gone, worthy, perfect Buddha Śākyamuni lives, thrives, and is well.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཞེས་བྱ་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་གོ་ཆ་བགོས་པ། མངོན་པར་ཤེས་པ་དང་། སྟོབས་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཐོབ་པ་ཞིག་ཡོད་དེ།
en: In that world there is a bodhisattva great being named Mañjuśrī Kumārabhūta, who wears the unfathomable armor and has attained all extraordinary abilities, strengths, and perfections.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དེས་ལྷུང་བཟེད་འདི་བླང་བའི་ཕྱིར་སྟན་ལས་མ་ལངས་བཞིན་དུ་ལག་པ་འདི་བཏང་ངོ་།
en: Without rising from his seat, Mañjuśrī Kumārabhūta has extended his hand to this place in order to pick up this alms bowl.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཡོངས་སུ་སྐོམ་པར་གྱུར་ནས། བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དེ་བལྟ་བར་འཚལ་ལོ་ཞེས་དེ་སྐད་གསོལ་ཏོ།
en: The bodhisattvas in the thus-gone Raśmirāja’s buddha realm became curious and announced, “Blessed One, we would like to see the Sahā world, the thus-gone Śākyamuni, and Mañjuśrī Kumārabhūta.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོས་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་འོད་ཕྱུང་ནས།
en: Light then shot forth from the circle of hair between the eyebrows of the thus-gone Raśmirāja.

source: འོད་དེས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བདུན་ཅུ་རྩ་གཉིས་པོ་དེ་དག་ཐམས་ཅད་བརྟོལ་ཏེ། ཐམས་ཅད་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ།
en: This light penetrated all the buddha realms totaling seventy-two times the number of grains of sand in the Ganges, illuminating all these worlds with a bright light.

source: །སེམས་ཅན་གང་དག་གི་ལུས་ལ་འོད་དེས་ཕོག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་འཁོར་ལོས་སྒྱུར་བའི་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏོ།
en: Anyone whose body was touched by this light gained the happiness of a universal monarch.

source: །རྣལ་འབྱོར་སྤྱོད་པ་གང་དག་གི་ལུས་ལ་འོད་དེས་ཕོག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་འབྲས་བུ་ཐོབ་པར་གྱུར་ཏོ།
en: Every spiritual practitioner whose body was touched by this light attained fruition.

source: །སློབ་པ་གང་དག་གི་ལུས་ལ་འོད་དེས་ཕོག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་བྱེད་པའི་དགྲ་བཅོམ་པར་གྱུར་ཏོ།
en: Every student whose body was touched by this light became a worthy one concentrated on the eight emancipations.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གི་ལུས་ལ་འོད་དེས་ཕོག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་ཏིང་ངེ་འཛིན་ཉི་མ་ལྟ་བུའི་སྒྲོན་མ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ།
en: Every bodhisattva whose body was touched by this light attained the absorption called the sun-like lamp.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་པ་འདི་དང་། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཐམས་ཅད་མཐོང་བར་གྱུར་ཏོ།
en: It also enabled all the bodhisattvas in the buddha realm of the thus-gone Raśmirāja to behold the Sahā world, the blessed Śākyamuni, Mañjuśrī Kumārabhūta, and the entire saṅgha of hearers.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཀྱི་དཔལ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་པ་འདི་མཐོང་ནས་ངུ་ཞིང་མཆི་མ་ཕྱུང་སྟེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When the bodhisattva great being Prabhāśrī beheld the Sahā world, he began to cry and weep.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་རིན་ཐང་མ་མཆིས་པའི་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་འདམ་དུ་སྩལ་བར་གྱུར་པ་དེ་བཞིན་དུ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་པར་སྐྱེས་པ་དེ་དག་ལ་བལྟ་བར་བགྱིའོ།
en: He said, “Blessed One, seeing these bodhisattva great beings who have been born into the Sahā world is like seeing a priceless beryl gem thrown into the mud.”

source: །དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་དེ་སྐད་མ་ཟེར་ཅིག །
en: The thus-gone Raśmirāja responded, “Noble son, do not say such things.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this?

source: གང་འཇིག་རྟེན་གྱི་ཁམས་འདིར་བསྐལ་པ་བཅུར་བསམ་གཏན་ལ་གནས་ཤིང་སྤྱོད་པ་བས་གང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་པར་སྔ་དྲོ་གཅིག་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་བསྐྱེད་ན་དེ་བས་འདིའི་བསོད་ནམས་ཤིན་ཏུ་མང་དུ་འཕེལ་ལོ།
en: Spending one morning in the Sahā world generating love for all beings brings far more merit than resting in and practicing concentration for ten eons in our world.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་དམ་པའི་ཆོས་སྲུང་བ་དེ་དག་ནི་ལས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་བྱང་བར་འགྱུར་རོ།
en: Noble son, bodhisattva great beings who tend to the Dharma in the Sahā world will purify all karmic obscurations and afflictions.”

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་པ་འདི་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་འོད་དེས་རེག་པར་གྱུར་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་དགའ་ཞིང་རབ་ཏུ་མགུ་བར་བགྱིད་པ་ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་སྤོང་བར་བགྱིད་པའི་འོད་ཟེར་འདི་སུའི་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Then all the bodhisattvas in the Sahā world whose bodies were touched by the light asked the Blessed One, “Blessed One, whose light is it that brings such joy and delight and removes all the afflictions?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འོག་གི་ཕྱོགས་ཀྱི་ཆ་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བདུན་ཅུ་རྩ་གཉིས་འདས་པ་དང་།
en: The Blessed One answered the bodhisattvas, “Noble sons, below here, past buddha realms as numerous as seventy-two times the number of grains of sand in the Ganges, is a buddha realm called Luminous.

source: འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟར་བཞུགས་ཤིང་འཚོ་གཞེས་པ་ཞིག་ཡོད་དེ།
en: There the thus-gone, worthy, perfect Buddha Raśmirāja lives, thrives, and is well.

source: དེ་བཞིན་གཤེགས་པ་དེས་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་འོད་བཏང་བ་དང་། འོད་དེས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་པ་འདི་སྣང་བར་བྱས་སོ།
en: From the circle of hair between his eyebrows, that thus-gone one has projected light that has now illuminated our Sahā world.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་དང་ལྡན་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེ་བལྟ་བར་འཚལ་ལོ།
en: The bodhisattvas then announced to the Blessed One, “Blessed One, we would like to see the world called Luminous and the thus-gone Raśmirāja.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ཞབས་ཀྱི་མཐིལ་འཁོར་ལོའི་རྩིབས་སྟོང་ཡོད་པ་གཉིས་ལས་འོད་ཟེར་གང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བདུན་ཅུ་རྩ་གཉིས་པོ་དེ་དག་ཐམས་ཅད་ལས་འདས་ཤིང་བརྟོལ་ནས་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་དང་ལྡན་པ་དེ་ཐམས་ཅད་འོད་ཟེར་དེ་དག་གིས་ཁྱབ་པར་འགྱུར་བ་དེ་འདྲ་བའི་འོད་ཟེར་འོག་ཏུ་བཏང་ནས་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གི་ལུས་ལ་འོད་ཟེར་དེས་ཕོག་པར་གྱུར་པ་དེ་ཐམས་ཅད་ཏིང་ངེ་འཛིན་རི་རབ་ལྷུན་པོ་ལྟ་བུའི་སྒྲོན་མ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: From the thousand-spoked wheels on the soles of his two feet, the blessed thus-gone Śākyamuni then emitted a light, which passed downward past buddha realms as numerous as seventy-two times the number of grains of sand in the Ganges until it illuminated the entire Luminous world. Every bodhisattva whose body was touched by this light attained the absorption called lamp like Mount Meru.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སྣང་བར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་སྣང་བར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ།
en: That buddha realm was illuminated from this buddha realm, and this buddha realm was illuminated from that buddha realm.

source: དཔེར་ན་འཛམ་བུའི་གླིང་འདི་ནས་ཉི་མ་དང་ཟླ་བ་སྣང་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་མཐོང་བར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེ་མཐོང་བར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ།
en: To give an analogy, just as the sun and moon shine here in Jambudvīpa, in the same way the bodhisattvas there were able to see the thus-gone Śākyamuni, and the bodhisattvas here were able to see the blessed thus-gone Raśmirāja.

source: དཔེར་ན་ལྷའི་བུ་དག་རི་རབ་ལྷུན་པོའི་སྤྱི་བོ་ལ་གནས་ཤིང་འཛམ་བུའི་གླིང་དུ་ལྟ་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དག་འཇིག་རྟེན་གྱི་ཁམས་འདི་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་དེ་དག་མཐོང་བར་གྱུར་ཏོ།
en: The bodhisattvas here in this world were able to see, as easily as the gods on the peak of Mount Meru can see Jambudvīpa, the blessed thus-gone Raśmirāja and the bodhisattva great beings wearing great armor.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ལག་པ་གཡས་པ་དེས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་དང་ལྡན་པ་དེ་ནས་ནམ་མཁའི་སྟེང་གི་ལམ་ལས་ལྷུང་བཟེད་དེ་བཟུང་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་སྟེང་དུ་ཕྱུང་བར་གྱུར་ཏོ།
en: Then, the right hand of Mañjuśrī Kumārabhūta grabbed the alms bowl, which was hovering in midair in the thus-gone Raśmirāja’s buddha realm Luminous, and he drew it upward, accompanied and attended on by trillions of bodhisattvas.

source: །གང་དང་གང་དག་ནས་ལག་པ་དེ་ཕྱུང་བར་གྱུར་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དང་དེ་དག་ཏུ་འོད་ཟེར་དེ་དག་ནུབ་པར་གྱུར་ཏོ། །མེ་ཏོག་པད་མ་དེ་དག་ཀྱང་མི་སྣང་བར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ།
en: As his hand drew back upward, the light rays in each buddha realm dimmed, and the lotus flowers disappeared.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ལག་པ་གཡས་པ་དེས་ལྷུང་བཟེད་དེ་བླངས་ནས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་པ་འདིར་ཕྱིན་པར་གྱུར་ཏེ།
en: In this way, drawn back by Mañjuśrī Kumārabhūta’s right hand, the alms bowl returned to the Sahā world.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་ལྷུང་བཟེད་དེ་ནམ་མཁའ་ལ་འཕངས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Having returned the alms bowl to the space before the blessed Śākyamuni, Mañjuśrī Kumārabhūta bowed his head to the feet of the Blessed One and said, “Blessed One, I retrieved the alms bowl.

source: །བཅོམ་ལྡན་འདས་ལྷུང་བཟེད་བླངས་པ་འདི་ལགས་ཀྱིས་དེ་བཞིན་གཤེགས་པས་བཞེས་སུ་གསོལ།
en: Thus-Gone One, please accept it.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ལྷུང་བཟེད་དེ་བཞེས་སོ།
en: The Blessed One did so.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ལག་པ་དང་ལྷན་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་པ་འདིར་འོངས་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། བདག་བདག་གི་དེ་བཞིན་གཤེགས་པའི་མཚན་ནས་བརྗོད་དེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆེ་གེ་མོ་ཞིག་བཅོམ་ལྡན་འདས་ལ་སྙུང་བ་མ་མཆིས་སམ། འོ་མ་བརྒྱལ་ཏམ། བཞེངས་པ་ཡང་ངམ། སོ་བཞིན་ནམ།
en: Then the bodhisattvas who had come to the Sahā world along with Mañjuśrī Kumārabhūta’s hand bowed their heads to the feet of the Blessed One and, using the names of their particular thus-gone ones, said, “The blessed thus-gone So-and-So is inquiring whether you, Blessed One, are free from illness, whether you are tired, whether you are healthy, whether you are comfortable, whether you are strong, and whether you are well.”

source: མཐུ་མངའ་འམ། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་གསུང་ངོ་ཞེས་དེ་སྐད་གསོལ་ཏེ། སངས་རྒྱས་ཀྱིས་གནང་ནས་བདག་བདག་གི་སྟན་ལ་འཁོད་དོ།
en: With the Buddha’s permission, they then took their seats.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ། དེ་བས་ན་ཤཱ་རིའི་བུ་ང་ལ་སྔོན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་གང་ཕན་བཏགས་པ་དེའི་ཕྱིར་ད་བྱས་པ་མི་གཟོ་བས་རྒོལ་བར་གྱུར་པ་བཤད་ཀྱིས་ཉོན་ཅིག།
en: Then the Blessed One said to venerable Śāriputra, “Śāriputra, listen: I shall now explain how I was in error by failing to appreciate how Mañjuśrī Kumārabhūta benefitted me in the past.

source: ཤཱ་རིའི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པ་དེའི་ཕ་རོལ་གྱིའང་ཕ་རོལ་དུ་གྱུར་པ་དེའི་ཚེ། དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་ཐུབ་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་འཇིག་རྟེན་གྱི་ཁམས་མི་སྨོད་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་འཇིག་རྟེན་དུ་སྐྱེས་པར་གྱུར་ཏེ།
en: Śāriputra, countless trillions of eons in the distant past, the thus-gone, worthy, perfect Buddha Invincible Banner of Victory was born in the world called Blameless.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དེའི་ཉན་ཐོས་ཀྱི་ཚོགས་ནི་བརྒྱད་ཁྲི་བཞི་སྟོང་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཁྲི་ཉིས་སྟོང་དུ་གྱུར་ཏེ།
en: Śāriputra, this thus-gone one’s retinue of hearers numbered eighty-four thousand, and his bodhisattvas numbered twelve thousand.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཐེག་པ་གསུམ་པོ་ཉིད་ལས་བརྩམས་ཏེ་ཆོས་འཆད་ཅིང་།
en: That thus-gone one taught the Dharma based on the three vehicles.

source: ཐེག་པ་གསུམ་བཤད་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། ཐབས་མཁས་པ་བཤད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་སྐྱེས་པར་གྱུར་ཏོ།
en: The Thus-Gone One took birth in order to teach the three vehicles, the six perfections, and skillful means. “

source: །ཤཱ་རིའི་བུ་ཡང་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་ཆོས་སྨྲ་བ་ཡེ་ཤེས་རྒྱལ་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། དེ་ནང་པར་ཤམ་ཐབས་བགོས།
en: Śāriputra, at that time there was also a monk, a Dharma teacher named Wisdom King.

source: ཆོས་གོས་དང་། ལྷུང་བཟེད་ཁྱེར་ཏེ་བསོད་སྙོམས་ཀྱི་ཕྱིར་རྒྱལ་པོའི་ཕོ་བྲང་རྒྱ་ཆེན་པོ་དང་ལྡན་པ་ཞེས་བྱ་བར་སོང་བ་ལས། དེ་དེ་ནས་ཟས་རོ་བརྒྱ་དང་ལྡན་པའི་བཟའ་བ་མང་པོ་ཁྱེར་ཏེ་བྱུང་བར་གྱུར་ཏོ།
en: One morning he donned his lower garment and Dharma robes, took his alms bowl, and went out to seek alms at the royal palace called Vastness, where he received many types of delicious food.

source: །ཡང་དེའི་ཚེ་ན་ཚོང་དཔོན་གྱི་བུ་དྲི་མ་མེད་པའི་དཔུང་པ་ཞེས་བྱ་བ་མ་མའི་པང་པ་ན་འདུག་པར་གྱུར་པ་ལས་ཁྱེའུ་དེས་དགེ་སློང་དེ་རྒྱང་མ་ནས་འོང་བ་མཐོང་ངོ་མཐོང་ནས་མ་མའི་པང་པ་ནས་བབས་ཏེ།
en: At that time there was also a merchant son named Flawless Shoulders, who was sitting on his mother’s lap.

source: དགེ་སློང་དེ་ག་ལ་བ་དེར་བརྒྱུགས་ནས་བཟའ་བ་བསླངས་པ་ལས།
en: The boy saw the monk approaching from afar and jumped off her lap and hurried toward the monk, asking for some food.

source: དགེ་སློང་དེས་དེ་ལ་མོད་ཀ་གཅིག་བྱིན་པ་དང་། དེ་བཟའ་བ་དེས་བརྙོགས་ནས་དགེ་སློང་དེའི་ཕྱི་བཞིན་དུ་འབྲང་བར་གྱུར་པ་ལས།
en: The monk gave him a sweetmeat, and he followed after the monk, nibbling on the food.

source: དེ་རིམ་གྱིས་དེ་བཞིན་གཤེགས་པ་མི་ཐུབ་པའི་རྒྱལ་མཚན་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་སྤྱན་སྔར་འདུག་གོ།
en: Eventually they arrived before the thus-gone Invincible Banner of Victory. They bowed at his feet and sat before him.

source: །དེ་ནས་དགེ་སློང་ཡེ་ཤེས་རྒྱལ་པོས་བསོད་སྙོམས་ཅི་རྙེད་པ་ཁྱེའུ་དེ་ལ་བྱིན་ནས།
en: Then the monk Wisdom King gave all his alms to the boy and said, ‘Listen, boy!

source: ཀྱེ་ཁྱེའུ་བསོད་སྙོམས་འདི་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་ཅིག་ཅེས་བྱས་སོ།
en: Present these alms to the Thus-Gone One.’

source: །དེ་ནས་ཁྱེའུ་དེས་བསོད་སྙོམས་དེ་བླངས་ཏེ། བཅོམ་ལྡན་འདས་དེའི་ལྷུང་བཟེད་བཀང་ཡང་བསོད་སྙོམས་དེ་ཡོངས་སུ་ཟད་པར་མ་གྱུར་ཏོ།
en: The boy took the alms, but even though he filled the Thus-Gone One’s alms bowl, the alms did not run out.

source: །ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ་བསོད་སྙོམས་གཅིག་པོ་དེ་ལས་ཁྱེའུ་དེས་ཉན་ཐོས་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཉིས་སྟོང་པོ་དེ་དག་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མི་ཐུབ་པའི་རྒྱལ་མཚན་དེ་ཞོས་པར་བྱས་ཤིང་བསྟབས་ཀྱང་བསོད་སྙོམས་དེ་ཡོངས་སུ་ཟད་པར་མ་གྱུར་ཏོ།
en: Śāriputra, even though the boy distributed and presented these alms alone to the eighty-four thousand hearers, the twelve thousand bodhisattvas, and the blessed thus-gone Invincible Banner of Victory, they did not run out.

source: །དེ་ནས་ཁྱེའུ་དེ་དགའ་མགུ་རངས་རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ། ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །དགེ་སློང་དགེ་འདུན་ཞོས་བྱས་ཀྱང་། །ལྷུང་བཟེད་ནམ་ཡང་མ་ཟད་པས།
en: The boy was happy and delighted. Filled with joy, happiness, and delight, he sat before the Blessed One and spoke the following verses: “ ‘Though I distributed alms to the saṅgha of monks, The alms bowl was never emptied.

source: །སྦྱིན་གནས་བསོད་ནམས་ཞིང་གྱུར་པ། །བདག་གིས་ངེས་པར་མཆོད་པར་གྱུར།
en: Thus, I have certainly performed worship To a field of merit worthy of offerings. “

source: །འཇིག་རྟེན་མགོན་པོ་ཞོས་བྱས་ཀྱང་། །འབྲས་ཅན་ཟད་པར་མ་གྱུར་པས།
en: ‘Even though I served it to the Protector of the World, The food did not run out.

source: །སངས་རྒྱས་ལ་ནི་ཕུལ་གྱུར་ན། །སྦྱིན་པ་མི་ཟད་ཐེ་ཙོམ་མེད།
en: There is no doubt that offerings made to the buddhas Are a gift that does not run out. “ ‘

source: །ཇི་ལྟར་འབྲས་ཅན་མི་ཟད་ཅིང་། །ཕྱི་ཕྱིར་འཕེལ་བར་འགྱུར་བ་ལྟར། །སངས་རྒྱས་དག་ལ་གང་གུས་པའི། །དགེ་བ་དག་ནི་དེ་བཞིན་འཕེལ།
en: Just as the food did not run out But increased more and more, So the merit of those who revere the buddhas Shall increase more and more.’ “

source: །ཤཱ་རིའི་བུ་དེ་ལྟ་སྟེ། ཁྱེའུ་དེས་བསོད་སྙོམས་གཅིག་པོ་དེ་ལས་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ཉི་མ་བདུན་དུ་ཞོས་པར་གསོལ་ནས་སངས་རྒྱས་ཀྱི་མཐུ་དང་།
en: Śāriputra, with those alms alone, the boy could provide for the Thus-Gone One and the saṅgha of monks for seven days.

source: ཁྱེའུ་དེའི་སེམས་ཀྱི་བསམ་པ་དད་པས་ཟས་དེ་ཡོངས་སུ་ཟད་པར་མ་གྱུར་ཏོ།
en: Through the power of the buddha and the boy’s pure intention, the food did not run out. “

source: །དེ་ནས་དགེ་སློང་ཡེ་ཤེས་རྒྱལ་པོས་ཁྱེའུ་དེ་སངས་རྒྱས་ལ་སྐྱབས་སུ་བཏང་། ཆོས་ལ་སྐྱབས་སུ་བཏང་། དགེ་འདུན་ལ་སྐྱབས་སུ་བཏང་ངོ་།
en: The monk Wisdom King offered the boy refuge in the Buddha, refuge in the Dharma, and refuge in the Saṅgha.

source: །ཁྲིམས་ཀྱང་ཕོག་གོ།
en: He conferred on him the rules.

source: །ཉེས་པ་ཡང་མཐོལ་དུ་བཅུག་གོ།
en: He caused the boy to acknowledge his faults.

source: །རྗེས་སུ་ཡི་རང་བར་བྱ་བ་དག་ཀྱང་རྗེས་སུ་ཡི་རང་བར་བྱེད་དུ་བཅུག་གོ།
en: He caused him to rejoice in that which should be rejoiced in.

source: །གསོལ་བ་གདབ་པར་བྱ་བ་དག་ཀྱང་གསོལ་བ་འདེབས་སུ་བཅུག་ནས་ཕྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་དུ་བཅུག་གོ།
en: He caused him to supplicate for what should be supplicated for, and later he caused him to develop the mind directed toward unsurpassed and perfect awakening. “

source: །ཤཱ་རིའི་བུ་དེ་ལྟ་སྟེ། ཁྱེའུ་དེའི་ཕ་དང་མ་ཁྱེའུ་དེ་ཚོལ་ཞིང་དེ་བཞིན་གཤེགས་པ་མི་ཐུབ་པའི་རྒྱལ་མཚན་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Śāriputra, the boy’s parents searched for him until they, too, arrived before the thus-gone Invincible Banner of Victory.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་སྤྱན་སྔར་འདུག་གོ།
en: They bowed their heads to the Blessed One’s feet and sat before him.

source: །དེ་ནས་ཁྱེའུ་དེས་ཕ་མ་དེ་དག་གི་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ལུས་ཅན་ཀུན་ལ་བདེ་བའི་ཕྱིར། །བདག་ནི་བྱང་ཆུབ་རབ་ཞུགས་ཀྱིས།
en: The boy prostrated at his parents’ feet and then spoke the following verses to them: “ ‘I have set forth toward awakening In order to bring all embodied beings happiness.

source: །ཁྱེད་ཀྱང་ལེགས་པར་གནས་པར་གྱིས། །དལ་འབྱོར་ཤིན་ཏུ་དཀོན་པའོ།
en: You should be persistent too, For these freedoms and advantages are so rare. “

source: །སངས་རྒྱས་སྐུ་ནི་འབར་བ་དང་། །མཚན་དག་གིས་ཀྱང་བརྒྱན་ལ་ལྟོས།
en: ‘See the radiance of the Buddha’s form And how he is adorned with the major marks.

source: །ཡེ་ཤེས་ཀྱིས་ནི་ཕ་རོལ་ཕྱིན།
en: He has reached perfection through wisdom.

source: །བྱང་ཆུབ་དེ་ལ་སུ་མི་སྨོན།
en: Who would not aspire to such awakening? “

source: །དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་དཀོན།
en: ‘The Thus-Gone One is exceedingly rare.

source: །བདག་ནི་ཁྱིམ་ནས་ཁྱིམ་མེད་པར། །འདི་ཉིད་དུ་ནི་རབ་ཏུ་འབྱུང་།
en: I wish to go forth into homelessness And take ordination with him.

source: །ཁྱེད་ཅག་གཉིས་ཀྱིས་གནང་བར་མཛོད།
en: I request your permission.’ “

source: །ཕ་དང་མས་སྨྲས་པ། བདག་ཅག་གཉིས་ནི་ཁྱོད་འདོད་ཀྱིས། །བྱང་ཆུབ་རབ་ལ་སྨོན་པར་བགྱིད།
en: His parents responded: “ ‘We will aspire to the awakening That you wish for.

source: །རབ་ཏུ་འབྱུང་བར་བགྱི་བའི་ཕྱིར། །བུ་ཁྱོད་ཀྱི་ནི་རྗེས་སུ་སློབ། །ཤཱ་རིའི་བུ་དེ་ལྟ་སྟེ། ཁྱེའུ་དེ་དང་།
en: Son, for the purpose of taking ordination, You may follow the training.’ “

source: ཁྱེའུ་དེའི་ཕ་མ་དང་། གང་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་སྲོག་ཆགས་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་བྱུང་ངོ་།
en: Then, Śāriputra, the boy, his parents, and five hundred beings who had developed the mind directed toward awakening all took ordination.

source: །ཤཱ་རིའི་བུ་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་ཆོས་སྨྲ་བ་ཡེ་ཤེས་རྒྱལ་པོ་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་སྙམ་དུ་ཤཱ་རིའི་བུ་ཁྱོད་དེ་ལྟར་མ་ལྟ་ཤིག །
en: Śāriputra, do not imagine that at that time the Dharma teacher Wisdom King was someone unknown to you.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་ཆོས་སྨྲ་བ་ཡེ་ཤེས་རྒྱལ་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Mañjuśrī Kumārabhūta was at that time the Dharma teacher Wisdom King.

source: །ཤཱ་རིའི་བུ་དེའི་ཚེ་དེའི་དུས་ན་ཚོང་དཔོན་གྱི་བུ་དྲི་མ་མེད་པའི་དཔུང་པ་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་ཐེ་ཙོམ་མམ། ཡིད་གཉིས་སམ། སོམ་ཉི་ཟ་ན། ཤཱ་རིའི་བུ་ཁྱོད་དེ་ལྟར་མ་ལྟ་ཤིག །
en: Śāriputra, if you are doubting, wondering, or considering whether the merchant’s son Flawless Shoulders is someone unknown to you, do not do so.

source: ང་ནི་དེའི་ཚེ་དེའི་དུས་ན་ཚོང་དཔོན་གྱི་བུ་དྲི་མ་མེད་པའི་དཔུང་པ་ཞེས་བྱ་བ་དེར་གྱུར་ཏེ།
en: I myself was at that time the merchant’s son Flawless Shoulders.

source: ཤཱ་རིའི་བུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ང་ལ་བསོད་སྙོམས་བྱིན་ནས་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་དུ་བཅུག་སྟེ།
en: Śāriputra, Mañjuśrī Kumārabhūta gave me the alms and caused me to develop the mind directed toward awakening.

source: དེ་ནི་ངས་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཐོག་མ་སེམས་བསྐྱེད་པ་ཡིན་ཏེ།
en: That is how I initially developed the mind directed toward awakening.
